
public class B01_If {

	/*
		# If¹®
		 - ()¾ÈÀÇ °ªÀÌ trueÀÏ ¶§ {}¾ÈÀÇ ³»¿ëÀ» ½ÇÇàÇÑ´Ù
		 - ()¾ÈÀÇ °ªÀÌ falseÀÏ ¶§ {}¾ÈÀÇ ³»¿ëÀ» ¹«½ÃÇÑ´Ù
		 - {}¾È¿¡¼­ ½ÇÇàÇÒ ³»¿ëÀÌ ´Ü ÇÑÁÙÀÌ¶ó¸é {}¸¦ »ý·«ÇÒ ¼ö ÀÖ´Ù
		 
		 
		# else if¹®
		 - À§¿¡ ÀÖ´Â if¹®ÀÌ ½ÇÇàµÇÁö ¾Ê¾Ò´Ù¸é ¹Ø¿¡¼­ if¹®Ã³·³ µ¿ÀÛÇÑ´Ù
		 - else if´Â ´Üµ¶À¸·Î »ç¿ëµÉ ¼ö ¾ø´Ù
		 - else if´Â ¿©·¯¹ø »ç¿ëÇÒ ¼ö ÀÖ´Ù
		 
		 
		# else¹®
		 - À§¿¡ ÀÖ´Â ¸ðµç if¹®°ú else if¹®ÀÌ ¸ðµÎ ½ÇÇàµÇÁö ¾Ê¾Ò´Ù¸é {}¾ÈÀÇ ³»¿ëÀÌ ¹«Á¶°Ç ½ÇÇàÇÑ´Ù
		 - if¹® ¹Ù·Î ´ÙÀ½¿¡ »ç¿ëÇÒ ¼öµµ ÀÖ´Ù
	*/
	
	public static void main(String[] args) {
		
		char ch = '*';
		
		if (ch >= '°¡' && ch <= 'ÆR') {
			System.out.println("ch¿¡ µé¾îÀÖ´Â °ªÀº ÇÑ±ÛÀÔ´Ï´Ù!");
			System.out.println("if¹® ³¡"); // ch°ªÀÌ ÇÑ±ÛÀÌ ¾Æ´Ò °æ¿ì ÇØ´ç ³»¿ëÀº ¹ÌÃâ·Â, ÇÑ±ÛÀÏ °æ¿ì µÎÁÙ ¸ðµÎ Ãâ·Â
		}else if (ch >= 'a' && ch <= 'z') {
			System.out.println("ch¿¡ µé¾îÀÖ´Â °ªÀº ¾ËÆÄºª ¼Ò¹®ÀÚÀÔ´Ï´Ù!");
		}else if (ch >= 'A' && ch <= 'Z') {
			System.out.println("ch¿¡ µé¾îÀÖ´Â °ªÀº ¾ËÆÄºª ´ë¹®ÀÚÀÔ´Ï´Ù!");
		}else {
			System.out.println("ch¿¡ µé¾îÀÖ´Â ¹®ÀÚ´Â ¾ËÆÄºªµµ ¾Æ´Ï°í ÇÑ±Ûµµ ¾Æ´Õ´Ï´Ù!");
		}
		
		System.out.println("ÇÁ·Î±×·¥ ³¡");
		
	}
}
