package quiz;

public class D05_Poker {

	/*
		(섯다, 포커, 오목, 체스, 장기, 테트리스 중 택1)을 구현해보세요
		
		poker
			- 로열 스트레이트 플레쉬 : 같은 무늬, 10 / J / Q / K / A
			- 백 스트레이트 플레쉬 : 같은 무늬, A / 2 / 3 / 4 / 5
			- 스트레이트 플레쉬 : 같은 무늬, 연속된 숫자 5개
			- 포카드 : 같은 숫자 4개
			- 풀하우스 : 같은 숫자 3개, 같은 숫자 2개
			- 플러쉬 : 같은 무늬 3장
			- 백 스트레이트 : A / 2 / 3 / 4 / 5
			- 스트레이트 : 연속된 숫자 5개
			- 트리플 : 같은 숫자 3개
			- 투페어 : 같은 숫자 2개
			- 원페어 : 같은 숫자 1개
			- 노페어 : 가장 높은 숫자 1장으로 승패
			- 무늬 별 높은 등급 ? : ♠ > ◆ > ♥ > ♣ (다른 경우도 있음..동네마다 다름)
	*/
	
}
